**Relembrando**  
  
A biblioteca **Pandas** proporciona uma forma eficiente de armazenagem e processamento de conjuntos de dados, e é utilizada como base para a construção da biblioteca Pandas, que estudaremos a seguir.

O diferencial do Numpy é sua velocidade e eficiência, o que faz com que ela seja amplamente utilizada para computação científica e analise de dados. 

A velocidade e eficiência é possível graças à estrutura chamada **numpy array**, que é um forma eficiente de guardar e manipular matrizes, que serve como base para as tabelas que iremos utilizar.

In [1]:
import pandas as pd
import numpy as np

## Series

O objeto fundamental do Pandas são as **Series**, uma classe do pandas.

As Series são as **colunas das tabelas** (que veremos mais a frente), e por baixo dos panos, os dados ficam armazenados como **numpy arrays**!

A diferença é que a série possui um **índice associado**, permitindo o acesso aos conteúdos dessa estrutura por ele, como um dicionário.

Além disso, as séries têm métodos específicos além dos que vimos pra arrays, o que será super útil!

Podemos criar uma série **a partir de uma lista**, usando a função do pandas `pd.Series()`:

### DataFrame

Agora que conhecemos as séries, vamos partir pro objeto do Pandas que mais utilizaremos: o **DataFrame**

Como veremos a seguir, o DataFrame é uma estrutura que se assemalha a uma **tabela**.

Estruturalmente, o DataFrame nada mais é que um **conjunto de Series**, uma para cada coluna (e, claro, com mesmo índice, que irão indexar as linhas).
  
Veremos depois como **ler um dataframe a partir de um arquivo** (que é provavelmente a forma mais comum)

Há muitas formas de construir um DataFrame do zero. Todas elas fazem uso da função **pd.DataFrame()**, como veremos a seguir.

Se quisermos especificar os índices de linha, o nome das colunas, e os dados, podemos passá-los separadamente:

## Exploração de dados

Em estatística, a análise exploratória de dados (EDA - Exploratory Data Analysis) é uma abordagem de análise de conjuntos de dados para resumir suas principais características, muitas vezes usando gráficos estatísticos e outros métodos de visualização de dados. Neste módulo vamos nos ater ao uso de tabelas e estatísticas para este trabalho, principalmente usando o ```pandas```.

In [2]:
df = pd.read_table('./dados/dados_parciais.txt', sep=';', decimal=',')

### Head

In [23]:
# O head é utilizado para observarmos o início de um dataframe
df.head(7)

  regiao  uf  superficie  pop_urbana  pop_rural      total
0  Norte  RO      238513    762864.0   468143.0  1231007.0
1  Norte  AC      153150    315401.0   168322.0   483726.0
2  Norte  AM     1577820   1766166.0   623113.0  2389279.0
3  Norte  RR      225116    174277.0    72854.0   247131.0
4  Norte  PA     1253165   2949017.0  2561832.0  5510849.0
5  Norte  AP      143454    330590.0    48869.0   379459.0
6  Norte  TO      278421    741009.0   307633.0  1048642.0

In [6]:
df[df['uf'] == 'PI']

     regiao  uf  superficie  pop_urbana  pop_rural      total
8  Nordeste  PI      252379   1556115.0  1117061.0  2673176.0

### Tail

In [7]:
# O tail é utilizado para observarmos o final de um dataframe
df.tail()

          regiao        uf  superficie  pop_urbana  pop_rural      total
24  Centro-Oeste        MS      358159   1604318.0   323516.0  1927834.0
25  Centro-Oeste        MT      906807   1695548.0   540284.0  2235832.0
26  Centro-Oeste        GO     3412895   3873722.0   642146.0  4515868.0
27  Centro-Oeste        DF        5822   1692248.0   129698.0  1821946.0
28           NaN  Ilhas***          10         NaN        NaN        NaN

### Info

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   regiao      28 non-null     object
 1   uf          29 non-null     object
 2   superficie  29 non-null     int64
 3   pop_urbana  27 non-null     float64
 4   pop_rural   27 non-null     float64
 5   total       27 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 1.5+ KB

### Describe

In [8]:
# Podemos sumarizar algumas estatísticas de várias colunas de uma única vez.
df.describe()

         superficie    pop_urbana     pop_rural         total
count  2.900000e+01  2.700000e+01  2.700000e+01  2.700000e+01
mean   4.006556e+05  4.558599e+06  1.259163e+06  5.817762e+06
std    6.894146e+05  6.443718e+06  1.162186e+06  7.084996e+06
min    1.000000e+01  1.742770e+05  4.886900e+04  2.471310e+05
25%    5.330700e+04  1.580216e+06  4.758745e+05  1.874890e+06
50%    1.997090e+05  2.176006e+06  7.151740e+05  2.802707e+06
75%    3.333660e+05  5.095113e+06  2.024133e+06  7.104462e+06
max    3.412895e+06  3.176922e+07  4.714902e+06  3.412089e+07

In [11]:
df_statistics = df.describe()

type(df_statistics)

pandas.core.frame.DataFrame

In [12]:
df_statistics['pop_rural']

count    2.700000e+01
mean     1.259163e+06
std      1.162186e+06
min      4.886900e+04
25%      4.758745e+05
50%      7.151740e+05
75%      2.024133e+06
max      4.714902e+06
Name: pop_rural, dtype: float64

### Outras estatísticas

In [13]:
# Obtendo uma estatística por vez
# Calculando a média
df.mean()

C:\Users\nagamatu\AppData\Local\Temp\ipykernel_12300\3959397390.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

superficie    4.006556e+05
pop_urbana    4.558599e+06
pop_rural     1.259163e+06
total         5.817762e+06
dtype: float64

In [14]:
# Calculando a mediana
df.median()

C:\Users\nagamatu\AppData\Local\Temp\ipykernel_12300\3547894964.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

superficie     199709.0
pop_urbana    2176006.0
pop_rural      715174.0
total         2802707.0
dtype: float64

In [15]:
# Calculando os quantis
df.quantile(0.1)

superficie     18804.4
pop_urbana    576841.4
pop_rural     152872.4
total         822675.6
Name: 0.1, dtype: float64

In [16]:
df.quantile([0.01, 0.99])

      superficie   pop_urbana  pop_rural        total
0.01      840.76    210969.24    55105.1    281536.28
0.99  2899074.00  26908525.76  4424729.0  29584460.86

In [18]:
# Obtendo valor mínimo de cada variável
df.min(numeric_only=True)

superficie        10.0
pop_urbana    174277.0
pop_rural      48869.0
total         247131.0
dtype: float64

In [24]:
# se quisermos estatísticas separadas por região
df.groupby('regiao').mean()

                superficie    pop_urbana     pop_rural         total
regiao
Centro-Oeste  1.170921e+06  2.216459e+06  4.089110e+05  2.625370e+06
Nordeste      1.561178e+05  3.243633e+06  1.730612e+06  4.974245e+06
Norte         5.528056e+05  1.005618e+06  6.072523e+05  1.612870e+06
Sudeste       2.318218e+05  1.495649e+07  1.794278e+06  1.675077e+07
Sul           1.924047e+05  6.052783e+06  1.786127e+06  7.838910e+06

In [25]:
df.groupby('regiao').sum()

              superficie  pop_urbana   pop_rural       total
regiao
Centro-Oeste     4683683   8865836.0   1635644.0  10501480.0
Nordeste         1561178  29192696.0  15575505.0  44768201.0
Norte            3869639   7039324.0   4250766.0  11290093.0
Sudeste           927287  59825958.0   7177111.0  67003069.0
Sul               577214  18158350.0   5358380.0  23516730.0

In [26]:
df[df['regiao'] == 'Centro-Oeste']

          regiao  uf  superficie  pop_urbana  pop_rural      total
24  Centro-Oeste  MS      358159   1604318.0   323516.0  1927834.0
25  Centro-Oeste  MT      906807   1695548.0   540284.0  2235832.0
26  Centro-Oeste  GO     3412895   3873722.0   642146.0  4515868.0
27  Centro-Oeste  DF        5822   1692248.0   129698.0  1821946.0

### Importando novo Dataframe

In [70]:
# importando o dataframe de municípios
df_muni = pd.read_table('./dados/populacao_brasileira_por_municipio.txt', sep=';', thousands='.')

In [71]:
df_muni.head()

   UF  COD. UF  COD. MUNIC      NOME DO MUNICÍPIO  POPULAÇÃO ESTIMADA
0  RO       11          15  Alta Floresta D'Oeste               22516
1  RO       11          23              Ariquemes              111148
2  RO       11          31                 Cabixi                5067
3  RO       11          49                 Cacoal               86416
4  RO       11          56             Cerejeiras               16088

### Colunas
  
Podemos acessar os dados de uma colunas de três métodos

In [72]:
df_muni['UF']

0       RO
1       RO
2       RO
3       RO
4       RO
        ..
5565    GO
5566    GO
5567    GO
5568    GO
5569    DF
Name: UF, Length: 5570, dtype: object

In [73]:
df_muni.UF

0       RO
1       RO
2       RO
3       RO
4       RO
        ..
5565    GO
5566    GO
5567    GO
5568    GO
5569    DF
Name: UF, Length: 5570, dtype: object

In [74]:
type(df_muni.UF)

pandas.core.series.Series

In [75]:
df_muni['UF']

0       RO
1       RO
2       RO
3       RO
4       RO
        ..
5565    GO
5566    GO
5567    GO
5568    GO
5569    DF
Name: UF, Length: 5570, dtype: object

In [76]:
# terceira forma - retorna um dataframe
df_muni[['UF']]

      UF
0     RO
1     RO
2     RO
3     RO
4     RO
...   ..
5565  GO
5566  GO
5567  GO
5568  GO
5569  DF

[5570 rows x 1 columns]

In [77]:
type(df_muni[['UF']])

pandas.core.frame.DataFrame

### Query
  
O método query permite realizar filtros dentro do nosso dataframe semelhante ao utilizado na linguagem SQL na clausula where

In [78]:
df_muni.rename(columns={'POPULAÇÃO ESTIMADA': 'populacao_estimada'}, inplace=True)

In [79]:
# quero saber quais cidades tem POPULAÇÃO ESTIMADA > 500.000
df_muni.query('populacao_estimada > 500000')

      UF  COD. UF  COD. MUNIC        NOME DO MUNICÍPIO  populacao_estimada
16    RO       11         205              Porto Velho              548952
111   AM       13        2603                   Manaus             2255903
160   PA       15         800               Ananindeua              540410
169   PA       15        1402                    Belém             1506420
303   AP       16         303                   Macapá              522357
635   MA       21       11300                 São Luís             1115932
882   PI       22       11001                 Teresina              871126
949   CE       23        4400                Fortaleza             2703391
1163  RN       24        8102                    Natal              896708
1337  PB       25        7507              João Pessoa              825796
1552  PE       26        7901  Jaboatão dos Guararapes              711330
1596  PE       26       11606                   Recife             1661017
1696  AL       27        4302                   Maceió             1031597
1754  SE       28         308                  Aracaju              672614
1957  BA       29       10800         Feira de Santana              624107
2162  BA       29       27408                 Salvador             2900319
2309  MG       31        6200           Belo Horizonte             2530701
2448  MG       31       18601                 Contagem              673849
2663  MG       31       36702             Juiz de Fora              577532
3067  MG       31       70206               Uberlândia              706597
3166  ES       32        5002                    Serra              536765
3173  ES       32        5200               Vila Velha              508655
3183  RJ       33         456             Belford Roxo              515239
3191  RJ       33        1009    Campos dos Goytacazes              514643
3199  RJ       33        1702          Duque de Caxias              929449
3222  RJ       33        3302                  Niterói              516981
3224  RJ       33        3500              Nova Iguaçu              825388
3242  RJ       33        4557           Rio de Janeiro             6775561
3247  RJ       33        4904              São Gonçalo             1098357
3375  SP       35        9502                 Campinas             1223237
3479  SP       35       18800                Guarulhos             1404694
3654  SP       35       34401                   Osasco              701428
3754  SP       35       43402           Ribeirão Preto              720116
3801  SP       35       47809              Santo André              723889
3811  SP       35       48708    São Bernardo do Campo              849874
3824  SP       35       49904      São José dos Campos              737310
3829  SP       35       50308                São Paulo            12396372
3848  SP       35       52205                 Sorocaba              695328
4005  PR       41        6902                 Curitiba             1963726
4102  PR       41       13700                 Londrina              580870
4398  SC       42        5407            Florianópolis              516524
4447  SC       42        9102                Joinville              604708
4701  RS       43        5108            Caxias do Sul              523716
4931  RS       43       14902             Porto Alegre             1492530
5122  MS       50        2704             Campo Grande              916001
5219  MT       51        3403                   Cuiabá              623614
5341  GO       52        1405     Aparecida de Goiânia              601844
5417  GO       52        8707                  Goiânia             1555626
5569  DF       53         108                 Brasília             3094325

In [80]:
# podemos usar uma variável
limite = 500000
df_muni.query('populacao_estimada > @limite')

      UF  COD. UF  COD. MUNIC        NOME DO MUNICÍPIO  populacao_estimada
16    RO       11         205              Porto Velho              548952
111   AM       13        2603                   Manaus             2255903
160   PA       15         800               Ananindeua              540410
169   PA       15        1402                    Belém             1506420
303   AP       16         303                   Macapá              522357
635   MA       21       11300                 São Luís             1115932
882   PI       22       11001                 Teresina              871126
949   CE       23        4400                Fortaleza             2703391
1163  RN       24        8102                    Natal              896708
1337  PB       25        7507              João Pessoa              825796
1552  PE       26        7901  Jaboatão dos Guararapes              711330
1596  PE       26       11606                   Recife             1661017
1696  AL       27        4302                   Maceió             1031597
1754  SE       28         308                  Aracaju              672614
1957  BA       29       10800         Feira de Santana              624107
2162  BA       29       27408                 Salvador             2900319
2309  MG       31        6200           Belo Horizonte             2530701
2448  MG       31       18601                 Contagem              673849
2663  MG       31       36702             Juiz de Fora              577532
3067  MG       31       70206               Uberlândia              706597
3166  ES       32        5002                    Serra              536765
3173  ES       32        5200               Vila Velha              508655
3183  RJ       33         456             Belford Roxo              515239
3191  RJ       33        1009    Campos dos Goytacazes              514643
3199  RJ       33        1702          Duque de Caxias              929449
3222  RJ       33        3302                  Niterói              516981
3224  RJ       33        3500              Nova Iguaçu              825388
3242  RJ       33        4557           Rio de Janeiro             6775561
3247  RJ       33        4904              São Gonçalo             1098357
3375  SP       35        9502                 Campinas             1223237
3479  SP       35       18800                Guarulhos             1404694
3654  SP       35       34401                   Osasco              701428
3754  SP       35       43402           Ribeirão Preto              720116
3801  SP       35       47809              Santo André              723889
3811  SP       35       48708    São Bernardo do Campo              849874
3824  SP       35       49904      São José dos Campos              737310
3829  SP       35       50308                São Paulo            12396372
3848  SP       35       52205                 Sorocaba              695328
4005  PR       41        6902                 Curitiba             1963726
4102  PR       41       13700                 Londrina              580870
4398  SC       42        5407            Florianópolis              516524
4447  SC       42        9102                Joinville              604708
4701  RS       43        5108            Caxias do Sul              523716
4931  RS       43       14902             Porto Alegre             1492530
5122  MS       50        2704             Campo Grande              916001
5219  MT       51        3403                   Cuiabá              623614
5341  GO       52        1405     Aparecida de Goiânia              601844
5417  GO       52        8707                  Goiânia             1555626
5569  DF       53         108                 Brasília             3094325

### .loc e .iloc

In [81]:
# .loc usado para pesquisar índices e colunas explicitamente

# quero a população urbana da segunda linha do dataset
df_muni.loc[1, 'populacao_estimada']

111148

In [82]:
# qual estado corresponde à segunda linha do dataset
df_muni.loc[1, :]

UF                           RO
COD. UF                      11
COD. MUNIC                   23
NOME DO MUNICÍPIO     Ariquemes
populacao_estimada       111148
Name: 1, dtype: object

In [83]:
df_muni.loc[ :10,'populacao_estimada']

0      22516
1     111148
2       5067
3      86416
4      16088
5      15213
6       7052
7      19255
8      33009
9      46930
10     51469
Name: populacao_estimada, dtype: int64

In [84]:
# posso usar lógicas para filtrar o dataset

# quais estados pertencem à região NE?
df_muni.loc[df_muni['UF'] == 'SP', 'COD. MUNIC': 'populacao_estimada']

      COD. MUNIC NOME DO MUNICÍPIO  populacao_estimada
3267         105        Adamantina               35153
3268         204            Adolfo                3545
3269         303             Aguaí               36981
3270         402    Águas da Prata                8262
3271         501  Águas de Lindóia               18908
...          ...               ...                 ...
3907       57006        Votorantim              124468
3908       57105       Votuporanga               96106
3909       57154          Zacarias                2784
3910       57204         Chavantes               12418
3911       57303      Estiva Gerbi               11507

[645 rows x 3 columns]

In [85]:
# quais estados pertencem à região NE e N?
df_muni.loc[(df_muni['UF'] == 'SP') | (df_muni['UF'] == 'RJ'), :]

      UF  COD. UF  COD. MUNIC   NOME DO MUNICÍPIO  populacao_estimada
3175  RJ       33         100      Angra dos Reis              210171
3176  RJ       33         159             Aperibé               12036
3177  RJ       33         209            Araruama              136109
3178  RJ       33         225               Areal               12763
3179  RJ       33         233  Armação dos Búzios               35060
...   ..      ...         ...                 ...                 ...
3907  SP       35       57006          Votorantim              124468
3908  SP       35       57105         Votuporanga               96106
3909  SP       35       57154            Zacarias                2784
3910  SP       35       57204           Chavantes               12418
3911  SP       35       57303        Estiva Gerbi               11507

[737 rows x 5 columns]

In [67]:
# iloc faz a referência aos índices e colunas de forma implícita
df_muni.iloc[2, 2]

31

In [86]:
# definir a coluna uf como a coluna de índice
df_muni = df_muni.set_index(['NOME DO MUNICÍPIO'])
df_muni.head()

                       UF  COD. UF  COD. MUNIC  populacao_estimada
NOME DO MUNICÍPIO
Alta Floresta D'Oeste  RO       11          15               22516
Ariquemes              RO       11          23              111148
Cabixi                 RO       11          31                5067
Cacoal                 RO       11          49               86416
Cerejeiras             RO       11          56               16088

In [88]:
# desejo obter a população do AC

# loc (explícito)
print(df_muni.loc['Cabixi', 'populacao_estimada'])

# iloc (implícito)
print(df_muni.iloc[2, 3])

5067
5067

In [89]:
# queremos as cidades que têm menos de 500000 habitantes (total)
df_muni.loc[df_muni.populacao_estimada < 500000, :]

                       UF  COD. UF  COD. MUNIC  populacao_estimada
NOME DO MUNICÍPIO
Alta Floresta D'Oeste  RO       11          15               22516
Ariquemes              RO       11          23              111148
Cabixi                 RO       11          31                5067
Cacoal                 RO       11          49               86416
Cerejeiras             RO       11          56               16088
...                    ..      ...         ...                 ...
Varjão                 GO       52       21908                3848
Vianópolis             GO       52       22005               14088
Vicentinópolis         GO       52       22054                9002
Vila Boa               GO       52       22203                6451
Vila Propício          GO       52       22302                5941

[5521 rows x 4 columns]

### Operações matemáticas

In [92]:
# quero saber a razão entre as população urbana e a população rural
df['razao_urbana_rural'] = df['pop_urbana']/df['pop_rural']
df.head()

  regiao  uf  superficie  pop_urbana  pop_rural      total  razao_urbana_rural
0  Norte  RO      238513    762864.0   468143.0  1231007.0            1.629553
1  Norte  AC      153150    315401.0   168322.0   483726.0            1.873795
2  Norte  AM     1577820   1766166.0   623113.0  2389279.0            2.834423
3  Norte  RR      225116    174277.0    72854.0   247131.0            2.392140
4  Norte  PA     1253165   2949017.0  2561832.0  5510849.0            1.151136

In [93]:
# se eu chamar uma coluna inexiste em modo de leitura
df['frac_pop']

KeyError: 'frac_pop'

In [94]:
# calcular a fração da população urbana sobre a geral
df['raza_urbana_total'] = df['pop_urbana']/df['total']
df.head()

,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total
0,Norte,RO,238513,762864.0,468143.0,1231007.0,1.629553,0.619707
1,Norte,AC,153150,315401.0,168322.0,483726.0,1.873795,0.652024
2,Norte,AM,1577820,1766166.0,623113.0,2389279.0,2.834423,0.739205
3,Norte,RR,225116,174277.0,72854.0,247131.0,2.392140,0.705201
4,Norte,PA,1253165,2949017.0,2561832.0,5510849.0,1.151136,0.535129

In [95]:
# iterar por cada linha e atribuir 1 se frac_urbana > 0.7 e 0 caso contrário
for i in df.index:
    if df.loc[i, 'raza_urbana_total'] > 0.7:
        df.loc[i, 'indicador'] = 1
    else:
        df.loc[i, 'indicador'] = 0

In [96]:
df.head()

,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total,indicador
0,Norte,RO,238513,762864.0,468143.0,1231007.0,1.629553,0.619707,0.0
1,Norte,AC,153150,315401.0,168322.0,483726.0,1.873795,0.652024,0.0
2,Norte,AM,1577820,1766166.0,623113.0,2389279.0,2.834423,0.739205,1.0
3,Norte,RR,225116,174277.0,72854.0,247131.0,2.392140,0.705201,1.0
4,Norte,PA,1253165,2949017.0,2561832.0,5510849.0,1.151136,0.535129,0.0

### Apply

In [97]:
# Uma outra forma de realizar isso é utilizando o apply
df['indicador'] = df['raza_urbana_total'].apply(lambda x:1 if x > 0.7 else 0)
df.head()

,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total,indicador
0,Norte,RO,238513,762864.0,468143.0,1231007.0,1.629553,0.619707,0
1,Norte,AC,153150,315401.0,168322.0,483726.0,1.873795,0.652024,0
2,Norte,AM,1577820,1766166.0,623113.0,2389279.0,2.834423,0.739205,1
3,Norte,RR,225116,174277.0,72854.0,247131.0,2.392140,0.705201,1
4,Norte,PA,1253165,2949017.0,2561832.0,5510849.0,1.151136,0.535129,0

In [98]:
# Também é possível criar funções
def soma_quadrados(row):
  # Esta é uma função que calcula a divisão da soma dos quadrados das populações urbana e rural, pelo total
  soma = (row['pop_urbana']**2 + row['pop_rural']**2) / (row['total'] ** 2)

  return soma

In [99]:
# usando o apply em múltiplas colunas
df['indicador2'] = df.apply(soma_quadrados, axis=1)
df.head()

,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total,indicador,indicador2
0,Norte,RO,238513,762864.0,468143.0,1231007.0,1.629553,0.619707,0,0.528660
1,Norte,AC,153150,315401.0,168322.0,483726.0,1.873795,0.652024,0,0.546218
2,Norte,AM,1577820,1766166.0,623113.0,2389279.0,2.834423,0.739205,1,0.614438
3,Norte,RR,225116,174277.0,72854.0,247131.0,2.392140,0.705201,1,0.584215
4,Norte,PA,1253165,2949017.0,2561832.0,5510849.0,1.151136,0.535129,0,0.502468

### map

In [100]:
ponto_cardeal = {
    'Norte': 'N',
    'Nordeste': 'NE',
    'Centro-Oeste': 'CO',
    'Sul': 'S',
    'Sudeste': 'SE'
}

# podemos fazer transformações com dicionários
df['regiao_cardeal'] = df['regiao'].map(ponto_cardeal)
df.head()

,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total,indicador,indicador2,regiao_cardeal
0,Norte,RO,238513,762864.0,468143.0,1231007.0,1.629553,0.619707,0,0.528660,N
1,Norte,AC,153150,315401.0,168322.0,483726.0,1.873795,0.652024,0,0.546218,N
2,Norte,AM,1577820,1766166.0,623113.0,2389279.0,2.834423,0.739205,1,0.614438,N
3,Norte,RR,225116,174277.0,72854.0,247131.0,2.392140,0.705201,1,0.584215,N
4,Norte,PA,1253165,2949017.0,2561832.0,5510849.0,1.151136,0.535129,0,0.502468,N

### Merge (join)

Outra tarefa muito comum quando estamos trabalhando com bases de dados é o **cruzamento**

Para fazer isso, utilizamos o método **.merge()**, cujos modos de cruzamento são:

<img src="https://community.qlik.com/legacyfs/online/87693_all-joins.png" width=450>

In [101]:
lista_on_left = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
lista_on_right = [1, 3, 5, 7, 9, 11]

In [108]:
dict_left = {'coluna_on': lista_on_left, 'valores_esquerda': lista_on_left}
dict_right = {'coluna_on': lista_on_right, 'valores_direita': lista_on_right}

df_left = pd.DataFrame(dict_left)
df_left

   coluna_on  valores_esquerda
0          1                 1
1          2                 2
2          3                 3
3          4                 4
4          5                 5
5          6                 6
6          7                 7
7          8                 8
8          9                 9
9         10                10

In [109]:
df_right = pd.DataFrame(dict_right)
df_right

   coluna_on  valores_direita
0          1                1
1          3                3
2          5                5
3          7                7
4          9                9
5         11               11

In [110]:
df_left.merge(df_right, how='outer')

    coluna_on  valores_esquerda  valores_direita
0           1               1.0              1.0
1           2               2.0              NaN
2           3               3.0              3.0
3           4               4.0              NaN
4           5               5.0              5.0
5           6               6.0              NaN
6           7               7.0              7.0
7           8               8.0              NaN
8           9               9.0              9.0
9          10              10.0              NaN
10         11               NaN             11.0

utilizando dataframes

In [111]:
df.head()

,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total,indicador,indicador2,regiao_cardeal
0,Norte,RO,238513,762864.0,468143.0,1231007.0,1.629553,0.619707,0,0.528660,N
1,Norte,AC,153150,315401.0,168322.0,483726.0,1.873795,0.652024,0,0.546218,N
2,Norte,AM,1577820,1766166.0,623113.0,2389279.0,2.834423,0.739205,1,0.614438,N
3,Norte,RR,225116,174277.0,72854.0,247131.0,2.392140,0.705201,1,0.584215,N
4,Norte,PA,1253165,2949017.0,2561832.0,5510849.0,1.151136,0.535129,0,0.502468,N

In [112]:
df_muni.head()

                       UF  COD. UF  COD. MUNIC  populacao_estimada
NOME DO MUNICÍPIO
Alta Floresta D'Oeste  RO       11          15               22516
Ariquemes              RO       11          23              111148
Cabixi                 RO       11          31                5067
Cacoal                 RO       11          49               86416
Cerejeiras             RO       11          56               16088

In [113]:
# retirar o uf dos índices
df_muni = df_muni.reset_index()
df_muni.head()

       NOME DO MUNICÍPIO  UF  COD. UF  COD. MUNIC  populacao_estimada
0  Alta Floresta D'Oeste  RO       11          15               22516
1              Ariquemes  RO       11          23              111148
2                 Cabixi  RO       11          31                5067
3                 Cacoal  RO       11          49               86416
4             Cerejeiras  RO       11          56               16088

In [116]:
df_reg = df_muni.merge(df, how='left', left_on=['UF'], right_on=['uf'])
df_reg

,NOME DO MUNICÍPIO,UF,COD. UF,COD. MUNIC,populacao_estimada,regiao,uf,superficie,pop_urbana,pop_rural,total,razao_urbana_rural,raza_urbana_total,indicador,indicador2,regiao_cardeal
0,Alta Floresta D'Oeste,RO,11,15,22516,Norte,RO,238513.0,762864.0,468143.0,1231007.0,1.629553,0.619707,0.0,0.528660,N
1,Ariquemes,RO,11,23,111148,Norte,RO,238513.0,762864.0,468143.0,1231007.0,1.629553,0.619707,0.0,0.528660,N
2,Cabixi,RO,11,31,5067,Norte,RO,238513.0,762864.0,468143.0,1231007.0,1.629553,0.619707,0.0,0.528660,N
3,Cacoal,RO,11,49,86416,Norte,RO,238513.0,762864.0,468143.0,1231007.0,1.629553,0.619707,0.0,0.528660,N
4,Cerejeiras,RO,11,56,16088,Norte,RO,238513.0,762864.0,468143.0,1231007.0,1.629553,0.619707,0.0,0.528660,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5565,Vianópolis,GO,52,22005,14088,Centro-Oeste,GO,3412895.0,3873722.0,642146.0,4515868.0,6.032463,0.857802,1.0,0.756045,CO
5566,Vicentinópolis,GO,52,22054,9002,Centro-Oeste,GO,3412895.0,3873722.0,642146.0,4515868.0,6.032463,0.857802,1.0,0.756045,CO
5567,Vila Boa,GO,52,22203,6451,Centro-Oeste,GO,3412895.0,3873722.0,642146.0,4515868.0,6.032463,0.857802,1.0,0.756045,CO
5568,Vila Propício,GO,52,22302,5941,Centro-Oeste,GO,3412895.0,3873722.0,642146.0,4515868.0,6.032463,0.857802,1.0,0.756045,CO
5569,Brasília,DF,53,108,3094325,Centro-Oeste,DF,5822.0,1692248.0,129698.0,1821946.0,13.047603,0.928813,1.0,0.867762,CO

Explorando os dados criados

In [118]:
# quero a média e o desvio padrão da população estimada por região
df_reg.groupby('regiao').mean()[['populacao_estimada']]

              populacao_estimada
regiao
Centro-Oeste        35775.880086
Nordeste            29827.873835
Norte               42015.471111
Sudeste             53736.757794
Sul                 25526.941226

In [121]:
df_reg.pivot_table(index='regiao', values='populacao_estimada', aggfunc=['mean', 'std'])

                           mean                std
             populacao_estimada populacao_estimada
regiao
Centro-Oeste       35775.880086      172714.901533
Nordeste           29827.873835      117781.505810
Norte              42015.471111      140141.406672
Sudeste            53736.757794      364442.832617
Sul                25526.941226       88461.904412

In [119]:
df_reg.groupby('regiao').agg({'populacao_estimada': ['mean', 'std']})

             populacao_estimada
                           mean            std
regiao
Centro-Oeste       35775.880086  172714.901533
Nordeste           29827.873835  117781.505810
Norte              42015.471111  140141.406672
Sudeste            53736.757794  364442.832617
Sul                25526.941226   88461.904412

### Bora praticar!

Importe novamente o DataFrame **alunos3.csv** usado nos exercícios da aula passada para responder às questões abaixo:

In [128]:
import pandas as pd
df_notas = pd.read_csv('./dados/alunos3.csv', sep=';', decimal=',')
df_notas.head()

       RA             Nome  Frequencia  Prova_1  Prova_2  Prova_3  Prova_4
0  110201   Antonio Carlos          20      6.5      8.5      7.0        6
1  110212      Ana Beatriz          20      7.0      7.0      7.0        8
2  110218    Carlos Vernes          17      7.0      7.0      7.0        7
3  110307  Francisco Cunha          20      9.0      8.5      8.5       10
4  110275      Sandra Rosa          15      6.5      7.5      7.0        7

Primeiramente utilize o mesmo código da aula passada para calcular a média das 4 provas.

In [132]:
df_notas['Media_provas'] = (df_notas['Prova_1'] + df_notas['Prova_2'] + df_notas['Prova_3'] + df_notas['Prova_4'])/4
df_notas

,RA,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas
0,110201,Antonio Carlos,20,6.5,8.5,7.0,6,7.000
1,110212,Ana Beatriz,20,7.0,7.0,7.0,8,7.250
2,110218,Carlos Vernes,17,7.0,7.0,7.0,7,7.000
3,110307,Francisco Cunha,20,9.0,8.5,8.5,10,9.000
4,110275,Sandra Rosa,15,6.5,7.5,7.0,7,7.000
5,110281,Juliana Arruda,18,7.5,7.0,7.5,8,7.500
6,110301,Joao Galo,20,5.0,6.5,7.0,5,5.875
7,110263,José Valente,20,10.0,10.0,10.0,10,10.000
8,110271,Maria Ferreira,19,9.5,8.0,7.0,10,8.625
9,110236,Adriana Tavares,20,8.0,8.0,8.0,8,8.000

1) Quem foram os alunos que obtiveram a maior e a menor média

In [131]:
df_notas_ordenado = df_notas.sort_values(by='Media_provas')

aluno_min_nota = df_notas_ordenado.iloc[0]['Nome']
aluno_max_nota = df_notas_ordenado.iloc[-1]['Nome']

print(f'Aluno com a maior nota: {aluno_max_nota}\nAluno com a menor nota: {aluno_min_nota}')

Aluno com a maior nota: José Valente
Aluno com a menor nota: Joao Galo

In [137]:
print(df_notas.loc[df_notas['Media_provas'].idxmin()])
print('')
print(df_notas.loc[df_notas['Media_provas'].idxmax()])

RA                 110301
Nome            Joao Galo
Frequencia             20
Prova_1               5.0
Prova_2               6.5
Prova_3               7.0
Prova_4                 5
Media_provas        5.875
Name: 6, dtype: object

RA                    110263
Nome            José Valente
Frequencia                20
Prova_1                 10.0
Prova_2                 10.0
Prova_3                 10.0
Prova_4                   10
Media_provas            10.0
Name: 7, dtype: object

In [139]:
nota_max = df_notas.max()['Media_provas']
df_notas[df_notas['Media_provas'] == nota_max]

,RA,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas
7,110263,José Valente,20,10.0,10.0,10.0,10,10.0

In [140]:
nota_min = df_notas.min()['Media_provas']
df_notas[df_notas['Media_provas'] == nota_min]

,RA,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas
6,110301,Joao Galo,20,5.0,6.5,7.0,5,5.875

In [141]:
df_notas.loc[(df_notas['Media_provas'] == df_notas['Media_provas'].max()) | (df_notas['Media_provas'] == df_notas['Media_provas'].min()), 'Nome']

6       Joao Galo
7    José Valente
Name: Nome, dtype: object

2. Crie uma coluna de ```status``` que possui o status de aprovação dos alunos seguindo os seguintes critérios, a partir da média das provas.
- até 5: Reprovado 
- acima de 5 e até 7: Recuperacao
- acima de 7: Aprovado

In [144]:
df_notas['status'] = df_notas['Media_provas'].apply(lambda x: 'Aprovado' if x > 7 else ('Recuperacao' if 5 < x <= 7 else 'Reprovado'))
df_notas

,RA,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas,status
0,110201,Antonio Carlos,20,6.5,8.5,7.0,6,7.000,Recuperacao
1,110212,Ana Beatriz,20,7.0,7.0,7.0,8,7.250,Aprovado
2,110218,Carlos Vernes,17,7.0,7.0,7.0,7,7.000,Recuperacao
3,110307,Francisco Cunha,20,9.0,8.5,8.5,10,9.000,Aprovado
4,110275,Sandra Rosa,15,6.5,7.5,7.0,7,7.000,Recuperacao
5,110281,Juliana Arruda,18,7.5,7.0,7.5,8,7.500,Aprovado
6,110301,Joao Galo,20,5.0,6.5,7.0,5,5.875,Recuperacao
7,110263,José Valente,20,10.0,10.0,10.0,10,10.000,Aprovado
8,110271,Maria Ferreira,19,9.5,8.0,7.0,10,8.625,Aprovado
9,110236,Adriana Tavares,20,8.0,8.0,8.0,8,8.000,Aprovado

In [146]:
for i in df_notas.index:
  if df_notas.loc[i, 'Media_provas'] > 7:
    df_notas.loc[i, 'status'] = 'Aprovado'
  elif 5 < df_notas.loc[i, 'Media_provas'] <= 7:
    df_notas.loc[i, 'status'] = 'Recuperação'
  else:
    df_notas.loc[i, 'status'] = 'Reprovado'

df_notas

,RA,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas,status
0,110201,Antonio Carlos,20,6.5,8.5,7.0,6,7.000,Recuperação
1,110212,Ana Beatriz,20,7.0,7.0,7.0,8,7.250,Aprovado
2,110218,Carlos Vernes,17,7.0,7.0,7.0,7,7.000,Recuperação
3,110307,Francisco Cunha,20,9.0,8.5,8.5,10,9.000,Aprovado
4,110275,Sandra Rosa,15,6.5,7.5,7.0,7,7.000,Recuperação
5,110281,Juliana Arruda,18,7.5,7.0,7.5,8,7.500,Aprovado
6,110301,Joao Galo,20,5.0,6.5,7.0,5,5.875,Recuperação
7,110263,José Valente,20,10.0,10.0,10.0,10,10.000,Aprovado
8,110271,Maria Ferreira,19,9.5,8.0,7.0,10,8.625,Aprovado
9,110236,Adriana Tavares,20,8.0,8.0,8.0,8,8.000,Aprovado

In [147]:
def definir_status(media):
    if media <= 5:
        return 'Reprovado'
    elif 5 < media <= 7:
        return 'Recuperação'
    else:
        return 'Aprovado'
    
df_notas['status'] = df_notas['Media_provas'].apply(definir_status)
df_notas

,RA,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas,status
0,110201,Antonio Carlos,20,6.5,8.5,7.0,6,7.000,Recuperação
1,110212,Ana Beatriz,20,7.0,7.0,7.0,8,7.250,Aprovado
2,110218,Carlos Vernes,17,7.0,7.0,7.0,7,7.000,Recuperação
3,110307,Francisco Cunha,20,9.0,8.5,8.5,10,9.000,Aprovado
4,110275,Sandra Rosa,15,6.5,7.5,7.0,7,7.000,Recuperação
5,110281,Juliana Arruda,18,7.5,7.0,7.5,8,7.500,Aprovado
6,110301,Joao Galo,20,5.0,6.5,7.0,5,5.875,Recuperação
7,110263,José Valente,20,10.0,10.0,10.0,10,10.000,Aprovado
8,110271,Maria Ferreira,19,9.5,8.0,7.0,10,8.625,Aprovado
9,110236,Adriana Tavares,20,8.0,8.0,8.0,8,8.000,Aprovado

3) Importe o arquivo ```cadastro_alunos.xlsx``` em um DataFrame ```df_cadastro``` e una este dataframe com o ```df_notas``` chamando de ```df_escola```

In [148]:
df_cadastro = pd.read_excel('./dados/cadastro_alunos.xlsx')
df_cadastro

       RA          Cidade       Sexo  Idade
0  110201       São Paulo  Masculino     15
1  110212  Rio de Janeiro   Feminino     20
2  110218  Rio de Janeiro  Masculino     18
3  110307  Belo Horizonte  Masculino     39
4  110275  Belo Horizonte   Feminino     22
5  110281  Rio de Janeiro   Feminino     17
6  110301  Belo Horizonte  Masculino     26
7  110263  Belo Horizonte  Masculino     31
8  110271       São Paulo   Feminino     29
9  110236       São Paulo   Feminino     16

In [150]:
df_escola = df_cadastro.merge(df_notas, how='outer')
df_escola

,RA,Cidade,Sexo,Idade,Nome,Frequencia,Prova_1,Prova_2,Prova_3,Prova_4,Media_provas,status
0,110201,São Paulo,Masculino,15,Antonio Carlos,20,6.5,8.5,7.0,6,7.000,Recuperação
1,110212,Rio de Janeiro,Feminino,20,Ana Beatriz,20,7.0,7.0,7.0,8,7.250,Aprovado
2,110218,Rio de Janeiro,Masculino,18,Carlos Vernes,17,7.0,7.0,7.0,7,7.000,Recuperação
3,110307,Belo Horizonte,Masculino,39,Francisco Cunha,20,9.0,8.5,8.5,10,9.000,Aprovado
4,110275,Belo Horizonte,Feminino,22,Sandra Rosa,15,6.5,7.5,7.0,7,7.000,Recuperação
5,110281,Rio de Janeiro,Feminino,17,Juliana Arruda,18,7.5,7.0,7.5,8,7.500,Aprovado
6,110301,Belo Horizonte,Masculino,26,Joao Galo,20,5.0,6.5,7.0,5,5.875,Recuperação
7,110263,Belo Horizonte,Masculino,31,José Valente,20,10.0,10.0,10.0,10,10.000,Aprovado
8,110271,São Paulo,Feminino,29,Maria Ferreira,19,9.5,8.0,7.0,10,8.625,Aprovado
9,110236,São Paulo,Feminino,16,Adriana Tavares,20,8.0,8.0,8.0,8,8.000,Aprovado

4) Qual a média entre as Media_provas dentro do público feminino? e masculino?

In [151]:
df_escola.groupby('Sexo')['Media_provas'].mean()

Sexo
Feminino     7.675
Masculino    7.775
Name: Media_provas, dtype: float64

In [156]:
df_escola.pivot_table(index='Sexo', values='Media_provas', aggfunc='mean')

           Media_provas
Sexo
Feminino          7.675
Masculino         7.775

In [153]:
media_feminino = df_escola.query('Sexo == "Feminino"')['Media_provas'].mean()
media_masculino = df_escola.query('Sexo == "Masculino"')['Media_provas'].mean()

print(f'A média da Media_provas dentro o publico feminino é: {media_feminino}\n\nA média da Media_provas dentro o publico masculino é: {media_masculino}')

A média da Media_provas dentro o publico feminino é: 7.675

A média da Media_provas dentro o publico masculino é: 7.775

In [155]:
df_media_m = df_escola[df_escola['Sexo'] == 'Masculino']
print(df_media_m['Media_provas'].mean())

df_media_f = df_escola[df_escola['Sexo'] == 'Feminino']
print(df_media_f['Media_provas'].mean())

7.775
7.675

5) Qual a média de idade das pessoas que obtiveram Media_provas maior ou igual a 7?

In [157]:
mediaIdade_aprovados = df_escola.loc[df_escola['Media_provas'] >= 7, 'Idade'].mean()
mediaIdade_aprovados

23.0

In [163]:
df_escola[df_escola['Media_provas'] >= 7].mean(numeric_only=True)['Idade']

23.0

In [165]:
df_escola[df_escola['Media_provas'] >= 7]['Idade'].mean()

23.0

6) Faça um código para mostrar a médias da coluna Media_provas entre as cidades, mostrando o valor para cada uma bem como ordenando de forma decrescente?

In [166]:
df_escola.pivot_table(index='Cidade', values='Media_provas', aggfunc='mean').sort_values(by='Media_provas', ascending=False)

                Media_provas
Cidade
Belo Horizonte       7.96875
São Paulo            7.87500
Rio de Janeiro       7.25000

In [172]:
df_cidade = df_escola.groupby('Cidade')
df_media_cidade = df_cidade.mean()

df_media_cidade_m = df_media_cidade.sort_values(by='Media_provas', ascending=False)

df_media_cidade_m[['Media_provas']]

                Media_provas
Cidade
Belo Horizonte       7.96875
São Paulo            7.87500
Rio de Janeiro       7.25000

In [175]:
mediaMediaProvas_cidades = df_escola.groupby('Cidade')['Media_provas'].mean().round(2).sort_values(ascending=False)
#display(mediaMediaProvas_cidades)
mediaMediaProvas_cidades

Cidade
Belo Horizonte    7.97
São Paulo         7.88
Rio de Janeiro    7.25
Name: Media_provas, dtype: float64

In [176]:
df_escola.groupby('Cidade').mean(numeric_only=True)[['Media_provas']].sort_values(by='Media_provas',ascending=False)

                Media_provas
Cidade
Belo Horizonte       7.96875
São Paulo            7.87500
Rio de Janeiro       7.25000

In [178]:
df_group_cidades = df_escola.groupby('Cidade').mean()
df_group_cidades.sort_values(by='Media_provas', ascending=False)[['Media_provas']]

                Media_provas
Cidade
Belo Horizonte       7.96875
São Paulo            7.87500
Rio de Janeiro       7.25000

## Mini tarefa

A partir do dataframe df_escola é possível obter as médias de notas de cada cidade a partir da coluna Media_provas. Realizando este calculo e ordenando de forma decrescente, responda no [link](https://forms.gle/a7Lzb7cxN4d2FzK16), qual cidade possui maior média? E qual é esta média?